In [2]:
import pandas as pd

In [3]:
df_track = pd.read_csv(r'Track_202408231950.csv')

In [4]:
df_track.groupby('Name')['Milliseconds'].sum()

Name
"40"                                                           157962
"?"                                                           2782333
"Eine Kleine Nachtmusik" Serenade In G, K. 525: I. Allegro     348971
#1 Zero                                                        299102
#9 Dream                                                       278312
                                                               ...
É que Nessa Encarnação Eu Nasci Manga                          196519
Étude 1, In C Major - Preludio (Presto) - Liszt                 51780
Óculos                                                         219271
Óia Eu Aqui De Novo                                            219454
Último Pau-De-Arara                                            200437
Name: Milliseconds, Length: 3257, dtype: int64

In [5]:
df_track

,Name,AlbumId,Milliseconds,Bytes
0,For Those About To Rock (We Salute You),1,343719,11170334
1,Balls to the Wall,2,342562,5510424
2,Fast As a Shark,3,230619,3990994
3,Restless and Wild,3,252051,4331779
4,Princess of the Dawn,3,375418,6290521
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,343,286741,4718950
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",344,139200,2283131
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",345,66639,1189062
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",346,221331,3665114
3502,Koyaanisqatsi,347,206005,3305164

In [6]:
df_track['Milliseconds']

0       343719
1       342562
2       230619
3       252051
4       375418
         ...
3498    286741
3499    139200
3500     66639
3501    221331
3502    206005
Name: Milliseconds, Length: 3503, dtype: int64

In [7]:
import numpy as np #matriz, array

In [8]:
vetor = np.array([10,20,30,40,50])

In [9]:
vetor

array([10, 20, 30, 40, 50])

In [10]:
matriz_2d = np.array([[10, 20], [4, 5]])

In [11]:
matriz_2d

array([[10, 20],
       [ 4,  5]])

In [13]:
res = 13 * 193
final = res * 4554

print(final)

11425986

#### Estruturas Unidimensionais - pandas series

In [18]:
s1 = pd.Series([10,20,30,40,50])
s2 = pd.Series([1,2,3,4,5])

s_soma = s1 + s2
s_sub = s1 - s2
s_mul = s1 * s2
s_div = s1 / s2

print(s_soma)
print(s_sub)
print(s_mul)
print(s_div)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [24]:
# Dar nome

s1 = pd.Series([10,20,30,40,50], name = 'Serie 1')
s2 = pd.Series([1,2,3,4,5], name = 'Serie 2')
print(s1)
print(s2)

0    10
1    20
2    30
3    40
4    50
Name: Serie 1, dtype: int64
0    1
1    2
2    3
3    4
4    5
Name: Serie 2, dtype: int64

In [25]:
df = pd.DataFrame({'Serie 1': s1, 'Serie 2': s2})
df

   Serie 1  Serie 2
0       10        1
1       20        2
2       30        3
3       40        4
4       50        5

In [26]:
soma = df['Serie 1'] + df['Serie 2']
soma

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [30]:
df['Soma'] = df['Serie 1'] + df['Serie 2']
df['Subtração'] = df['Serie 1'] - df['Serie 2']
df['Multiplicação'] = df['Serie 1'] * df['Serie 2']
df['Divisão'] = df['Serie 1'] / df['Serie 2']

df

   Serie 1  Serie 2  Soma  Subtração  Multiplicação  Divisão
0       10        1    11          9             10     10.0
1       20        2    22         18             40     10.0
2       30        3    33         27             90     10.0
3       40        4    44         36            160     10.0
4       50        5    55         45            250     10.0

In [32]:
s1 = pd.Series([10,20,30,40,50], name = 'Serie 1')
s2 = pd.Series([1,2,3,4,5], name = 'Serie 2')
s3 = pd.Series(['A','B','C','D','E'], name = 'Serie 3')

df = pd.DataFrame({'Serie 1': s1, 'Serie 2': s2, 'Serie 3': s3})

df['Soma'] = df['Serie 1'] + df['Serie 2']
df['Subtração'] = df['Serie 1'] - df['Serie 2']
df

   Serie 1  Serie 2 Serie 3  Soma  Subtração
0       10        1       A    11          9
1       20        2       B    22         18
2       30        3       C    33         27
3       40        4       D    44         36
4       50        5       E    55         45

In [1]:
df.groupby('Serie 3')['soma'].max()
df.groupby('Serie 3')['soma'].min()
df.groupby('Serie 3')['soma'].mean()
df.groupby('Serie 3')['soma'].median()
df.groupby('Serie 3')['soma'].std() #desvio padrão

NameError: name 'df' is not defined